loadtest/results/20260922-183711/1-no-cache.txt
Running 1m test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 117.379ms, rate sampling interval: 288ms
  Thread calibration: mean lat.: 115.341ms, rate sampling interval: 284ms
  Thread calibration: mean lat.: 114.996ms, rate sampling interval: 269ms
  Thread calibration: mean lat.: 116.145ms, rate sampling interval: 262ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.92ms   25.66ms   1.69s    93.66%
    Req/Sec   124.81     63.88   191.00     68.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   97.09ms
 75.000%  104.13ms
 90.000%  112.89ms
 99.000%  162.43ms
 99.900%  225.15ms
 99.990%    1.27s 
 99.999%    1.69s 
100.000%    1.69s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      79.999     0.000000            1         1.00
      91.199     0.100000         2589         1.11
      92.671     0.200000         5031         1.25
      94.015     0.300000         7518         1.43
      95.423     0.400000         9995         1.67
      97.087     0.500000        12535         2.00
      98.111     0.550000        13738         2.22
      99.327     0.600000        15001         2.50
     100.607     0.650000        16217         2.86
     102.207     0.700000        17461         3.33
     104.127     0.750000        18715         4.00
     105.279     0.775000        19360         4.44
     106.367     0.800000        19963         5.00
     107.647     0.825000        20603         5.71
     109.055     0.850000        21212         6.67
     110.591     0.875000        21824         8.00
     111.615     0.887500        22139         8.89
     112.895     0.900000        22449        10.00
     114.687     0.912500        22764        11.43
     118.335     0.925000        23065        13.33
     128.383     0.937500        23376        16.00
     132.735     0.943750        23536        17.78
     135.679     0.950000        23694        20.00
     139.519     0.956250        23844        22.86
     143.103     0.962500        24006        26.67
     146.047     0.968750        24157        32.00
     147.711     0.971875        24234        35.56
     148.991     0.975000        24318        40.00
     150.015     0.978125        24389        45.71
     151.679     0.981250        24473        53.33
     153.983     0.984375        24546        64.00
     155.903     0.985938        24584        71.11
     157.951     0.987500        24626        80.00
     160.639     0.989062        24663        91.43
     163.583     0.990625        24703       106.67
     165.503     0.992188        24742       128.00
     166.655     0.992969        24759       142.22
     168.191     0.993750        24779       160.00
     169.983     0.994531        24800       182.86
     171.391     0.995313        24819       213.33
     173.823     0.996094        24837       256.00
     175.487     0.996484        24847       284.44
     179.071     0.996875        24857       320.00
     181.247     0.997266        24866       365.71
     185.215     0.997656        24876       426.67
     189.567     0.998047        24886       512.00
     192.383     0.998242        24891       568.89
     199.423     0.998437        24896       640.00
     208.255     0.998633        24900       731.43
     219.135     0.998828        24905       853.33
     229.887     0.999023        24910      1024.00
     252.031     0.999121        24913      1137.78
     255.871     0.999219        24915      1280.00
     286.719     0.999316        24917      1462.86
     391.935     0.999414        24920      1706.67
     507.391     0.999512        24922      2048.00
     585.215     0.999561        24924      2275.56
     658.943     0.999609        24925      2560.00
     811.007     0.999658        24926      2925.71
     853.503     0.999707        24927      3413.33
     893.951     0.999756        24928      4096.00
     963.583     0.999780        24929      4551.11
    1076.223     0.999805        24930      5120.00
    1076.223     0.999829        24930      5851.43
    1163.263     0.999854        24931      6826.67
    1163.263     0.999878        24931      8192.00
    1272.831     0.999890        24932      9102.22
    1272.831     0.999902        24932     10240.00
    1272.831     0.999915        24932     11702.86
    1377.279     0.999927        24933     13653.33
    1377.279     0.999939        24933     16384.00
    1377.279     0.999945        24933     18204.44
    1377.279     0.999951        24933     20480.00
    1377.279     0.999957        24933     23405.71
    1686.527     0.999963        24934     27306.67
    1686.527     1.000000        24934          inf
#[Mean    =      101.916, StdDeviation   =       25.655]
#[Max     =     1685.504, Total count    =        24934]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29798 requests in 1.00m, 10.37MB read
  Non-2xx or 3xx responses: 5491
Requests/sec:    494.33
Transfer/sec:    176.20KB
------------------------------
X-Cache  HIT=0  MISS=0  BYPASS=24307  writes=0  http_errors=5491
Socket errors: connect=0 read=0 write=0 timeout=0
p50       97.09 ms
p90      112.89 ms
p99      162.43 ms
p99.9    225.15 ms