loadtest/results/20260922-183711/2-cache-aside.txt
Running 1m test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 121.065ms, rate sampling interval: 313ms
  Thread calibration: mean lat.: 129.102ms, rate sampling interval: 354ms
  Thread calibration: mean lat.: 130.324ms, rate sampling interval: 371ms
  Thread calibration: mean lat.: 130.011ms, rate sampling interval: 365ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   100.07ms   20.74ms   1.74s    97.21%
    Req/Sec   125.02     31.82   160.00     89.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   97.22ms
 75.000%  102.21ms
 90.000%  107.84ms
 99.000%  156.54ms
 99.900%  320.51ms
 99.990%    1.12s 
 99.999%    1.74s 
100.000%    1.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      84.991     0.000000            1         1.00
      91.903     0.100000         2508         1.11
      93.439     0.200000         5006         1.25
      94.655     0.300000         7507         1.43
      95.871     0.400000        10078         1.67
      97.215     0.500000        12528         2.00
      97.983     0.550000        13792         2.22
      98.879     0.600000        15043         2.50
      99.839     0.650000        16266         2.86
     100.991     0.700000        17508         3.33
     102.207     0.750000        18787         4.00
     102.911     0.775000        19363         4.44
     103.679     0.800000        19986         5.00
     104.511     0.825000        20641         5.71
     105.407     0.850000        21237         6.67
     106.559     0.875000        21884         8.00
     107.135     0.887500        22164         8.89
     107.839     0.900000        22488        10.00
     108.671     0.912500        22807        11.43
     109.567     0.925000        23109        13.33
     110.591     0.937500        23421        16.00
     111.167     0.943750        23570        17.78
     112.127     0.950000        23732        20.00
     113.471     0.956250        23885        22.86
     115.199     0.962500        24038        26.67
     118.079     0.968750        24192        32.00
     120.639     0.971875        24269        35.56
     126.591     0.975000        24348        40.00
     135.167     0.978125        24425        45.71
     143.999     0.981250        24503        53.33
     148.223     0.984375        24584        64.00
     149.631     0.985938        24620        71.11
     151.935     0.987500        24659        80.00
     154.623     0.989062        24698        91.43
     159.615     0.990625        24737       106.67
     164.223     0.992188        24777       128.00
     165.375     0.992969        24798       142.22
     166.655     0.993750        24815       160.00
     168.959     0.994531        24835       182.86
     170.111     0.995313        24857       213.33
     171.007     0.996094        24876       256.00
     171.519     0.996484        24885       284.44
     172.799     0.996875        24893       320.00
     176.255     0.997266        24903       365.71
     180.223     0.997656        24913       426.67
     186.111     0.998047        24923       512.00
     193.535     0.998242        24928       568.89
     203.391     0.998437        24932       640.00
     272.383     0.998633        24937       731.43
     317.951     0.998828        24943       853.33
     320.767     0.999023        24947      1024.00
     322.815     0.999121        24951      1137.78
     324.351     0.999219        24953      1280.00
     324.863     0.999316        24954      1462.86
     326.143     0.999414        24957      1706.67
     327.423     0.999512        24959      2048.00
     328.703     0.999561        24961      2275.56
     329.727     0.999609        24962      2560.00
     344.831     0.999658        24963      2925.71
     428.031     0.999707        24964      3413.33
     462.079     0.999756        24965      4096.00
     515.327     0.999780        24966      4551.11
     580.095     0.999805        24967      5120.00
     580.095     0.999829        24967      5851.43
     826.367     0.999854        24968      6826.67
     826.367     0.999878        24968      8192.00
    1122.303     0.999890        24969      9102.22
    1122.303     0.999902        24969     10240.00
    1122.303     0.999915        24969     11702.86
    1432.575     0.999927        24970     13653.33
    1432.575     0.999939        24970     16384.00
    1432.575     0.999945        24970     18204.44
    1432.575     0.999951        24970     20480.00
    1432.575     0.999957        24970     23405.71
    1740.799     0.999963        24971     27306.67
    1740.799     1.000000        24971          inf
#[Mean    =      100.073, StdDeviation   =       20.743]
#[Max     =     1739.776, Total count    =        24971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29701 requests in 1.00m, 10.19MB read
  Non-2xx or 3xx responses: 6935
Requests/sec:    492.74
Transfer/sec:    173.14KB
------------------------------
X-Cache  HIT=18018  MISS=4748  BYPASS=0  writes=0  http_errors=6935
Cache hit ratio: 79.14%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       97.22 ms
p90      107.84 ms
p99      156.54 ms
p99.9    320.51 ms